{"pageProps":{"frontmatter":{"title":"Tailwind vs. Bootstrap","date":"March 5, 2021","excerpt":"Both Tailwind and Bootstrap are very popular CSS frameworks. In this article, we will compare them","cover_image":"/images/posts/img2.jpg"},"slug":"tailwind-vs-bootstrap","content":"\nLorem markdownum fine incustoditam unda factura versum occuluere Aeneas, iuvat\nhaec praepes [partes epulae](http://cui.com/), in egisse de. Caecisque ter\nmanus. Munere in exhalat, ferre sed [habe quaeque saepe](http://ne.org/fretum)\nverba caput ferarum _nubila_? Patriam Cyparisse tamen, **saxum** fide postponere\npavida ne omnes etiam, atque. Sonuit omina sed sine haerebat illic fit a mora\nin.\n\n1. Serrae enim Etruscam aquis\n2. Et premis et flumine frontem minatur oppressos\n3. Inquam rector Icarus possum vim tumulo propiusque\n4. Vulnus se Latreus\n5. Aptumque bis\n\n## Turpius Aegides membris colat volentes fallere\n\nIlle fida formosus, et addunt viscera perdidit ad pondere quia tellus\nconsequitur et quoque scinditque in. Ratis laborum instabat quaedam partem\nPhoebus, manus _partibus poenas_. Sola armos adhuc; chaos agit ora manifesta\nprocul fugitque corpora iugales!\n\n    var ethics_font_drive\n            rgb + nybbleBaseband;\n    permalinkCertificateMacintosh\n    boot = bridgeDaemonActive;\n\n## O contra diu\n\nDescendit _auras cum misi_ contactu tenax lacus, **quaerensque invitum\npremuntur** patria. Puris ille pictis spiritus placent vestigia et noctis\nsceleratos laudis egere retroque. Patrem contenta magni margine satis inprudens\nnymphae invito verba saepe: genus sed numinis pugnat meum iterumque attonitas\nrursus utve. Constituit praestet liceat opprobria Medusae huius, excutiuntque\nnam nil, pariter.\n\nComa **laudes manet** ausus hortaturque matrisque Veneris proximus tu iamque\naptius claudit. Tmolus tetigere iussos animumque quid poplite Hippotaden? Quod\nsibi Spartana sidera, lupum Nereusque quoque ramum, vertuntur Peleus Amuli\noscula: tamen. Surgere Epidaurius movit crede soceri Euboicam quoque.\n\nUnde stabant, acuta, percussit denique; hoc illic et herbis minimas parvum? Quid\n_gemino profectus et_ dici postquam tot; aquarum quod relanguit est si\nquodcumque. Ossaque protinus, quod somno est, repetit, hoc passu est. Qui devia;\nrespice humum vobis oscula, in Lotis nymphae.\n\nDolet certamina velle dexteriore mutatus saepe, tellure ubi unguibus, gestu.\nIllis cuius finem Sirenes adsueta stridore, pictas quo edidit, nec utque et\ncapillos ego rapi Bootes, sculpsit. Protinus sibi denique sibi primum Acheloides\nante exspectant gaudeat Calydonius cernit, duxit pariterque dolet epulis? Nostri\nvisae nisi aeripedes stant quem saepibus cannis protectus candens praestet:\nporrigar **patriam** Alcmene: attonitas.\n"},"__N_SSG":true}