{"pageProps":{"frontmatter":{"title":"Mother's Day","date":"May 14, 2023","excerpt":"Words are bound to fall short when it comes to Mothers and what they go through their entire life for their children.","cover_image":"/images/posts/motherday/mDayCover.png","author":"Waleed Raza"},"slug":"mother-day","content":"\nWords are bound to fall short when it comes to Mothers and what they go through their entire life for their children. To sum it up in one day is impossible so Mother’s Day is just a day to highlight how Important Mothers are to us! In our daily lives, we get so busy that often we tend to neglect the little gestures mothers give us and how she cares for us, asking about our health and always trying to serve us food! So Prixite came up with an amazing Idea and asked all its employees to take their Mothers out for dinner to spend some quality time while relieving her of kitchen work!\n\nHere is a glimpse of how it went from our employees' eyes! Let’s live in the moment and hear how the day with their mother went!\n\n##### Uzair\n\nIt was a delightful evening with my mother, filled with warmth and love. We decided to celebrate at a restaurant with special memories for our family.\nThe atmosphere was lovely. The restaurant had prepared a special Mother’s Day menu, offering various dishes. The food was amazing and we enjoyed every bite. It was a time of appreciating the love and support my mother has always given me. I am grateful for the opportunity to spend quality time with my mother.\n\n![Photo 1](/images/posts/motherday/photo1.jpg#image-40)\n\n##### Nabeel\n\nI would like to express my heartfelt gratitude for the wonderful Mother's Day hi-tea experience arranged by Prixite. It provided an exceptional opportunity for me to show my appreciation to my mother, who means the world to me.\n\nWe chose Spice Bazaar, as it is my mother's favorite place for hi-tea because of the ambiance and culinary delights. Prixite's thoughtful initiative allowed me to express my gratitude for all that my mother does for me, even though I know I can never fully repay her.\n\nI truly value the company's gesture of appreciation towards my super mom, and I wanted to extend my kudos to Prixite for organizing such a brilliant gesture.\n\n![Photo 2](/images/posts/motherday/photo2.jpg#image-40)\n\n##### Waleed\n\nWhen I told my mother, we would go out, she could not believe it for a while but was very excited. I took my Mother to Golden Bowl, a Chinese restaurant. She had not been there first, so I decided to do something different. The ambiance was super warm and the aesthetics were just the ones mom would love! The food was super great and everyone loved it! For me, it was a great opportunity to bond with my mother and spend time with her!\n\n![Lava Cake](/images/posts/motherday/photo3.jpg#image-20)\n\n##### Maria\n\nMy mother preferred staying at home rather than going out, so I wanted to organize something special for her on Mother's Day. She loves Tehzeeb pizza, so I thought it would be a great idea to have a delicious pizza dinner. It was a wonderful treat for her on her special day, and we thoroughly enjoyed the meal. Thank you so much, Prixite!\n\n![Gift](/images/posts/motherday/photo4.png#image-20)\n\n##### Fahad\n\nOn Mother's Day, I had the most wonderful experience celebrating with my family. We spent the day together, expressing our love and gratitude for my amazing mother. We started the day with a delicious homemade breakfast, followed by some thoughtful gifts. In the afternoon, we went for a leisurely walk in the park, enjoying the beautiful weather and cherishing each other's company. It was a day filled with laughter, hugs, and precious moments that I will treasure forever.\n\nWhat made this Mother's Day even more special was the generosity of my company, Prixite. The company's gesture demonstrated its commitment to work-life balance and its appreciation for the importance of family. I am grateful for the support and proud to be part of an organization that values its employees and acknowledges the significance of special occasions like Mother's Day.\n\n##### Naila\n\nThis time my Mother's Day celebration was truly amazing, as I told my mom that my company is going to cover for our treat and she thought that I was kidding with her! We enjoyed a great evening together, and had a nice dinner at Bozo Lahore, followed by a sweet treat at home. It was a lovely gesture from Prixite!\n\n![Group Photo](/images/posts/motherday/photo5.jpg#image-20)\n\nSuch sweet memories garnished, thanks to Mother’s Day. Always remember, never wait for this specific day to express your love for your mother!\n"},"__N_SSG":true}