{"pageProps":{"frontmatter":{"title":"What's new in next.js 13 - A Developer's Guide","date":"June 09, 2023","excerpt":"Next.js is a popular open-source framework for building modern web applications using React.","cover_image":"/images/posts/whatsnewinnextjs/nextjs13-cover.png","author":"Umair Jameel"},"slug":"whats-new-in-nextjs-13","content":"\n#### What is Next.js?\n\n[Next.js](https://nextjs.org/) is a popular open-source framework for building web applications with React. Next.js provides a streamlined development experience by offering server-side rendering (SSR), static site generation (SSG), and client-side rendering capabilities.\n\nWith Next.js, developers can build modern, dynamic web applications that are optimized for performance and SEO. It simplifies the process of creating server-rendered React applications by providing a structured setup and routing system.\n\n<br>\n#### What's new in Next.js 13?\nNext.js 13 comes with new directory structure for routes and apis along with some new buildin layout and loading files.\n\nUse this command to create a new next.js app with new version: <b>npx create-next-app@latest</b>\n\nDuring installation, it will show you following prompts:\n\n    > What is your project named? my-app\n    > Would you like to use TypeScript with this project? No / Yes\n    > Would you like to use ESLint with this project? No / Yes\n    > Would you like to use Tailwind CSS with this project? No / Yes\n    > Would you like to use `src/` directory with this project? No / Yes\n    > Use App Router (recommended)? No / Yes\n    > Would you like to customize the default import alias? No / Yes\n\nNext.js now ships with <b>TypeScript, ESLint, and Tailwind CSS</b> configuration by default.\n\nThese are the major upgrades added in this new version are these:\n\n1.  Typescript by Default\n2.  /app Directory for File-Based Routing\n3.  React Server Components\n4.  Async Components & Data Fetching\n5.  Loading and Streaming\n6.  Turbopack\n7.  Upgrades in next/image, next/link, next/font\n8.  MetaData\n\n<br>\n##### 1. Typescript by Default\n“Next.js provides a TypeScript-first development experience for building your React application.\n\nIt comes with built-in TypeScript support for automatically installing the necessary packages and configuring the proper settings.\nAs well as a TypeScript Plugin for your editor.”\n\nRead More: [Typescript in Next.js 13+](https://nextjs.org/docs/app/building-your-application/configuring/typescript)\n\n<br>\n##### 2. /app Directory for File-Based Routing\nNext.js 13 includes updated file routing with the new directory. The app directory introduces a new layout, loading structure as well as several new features and improvements.\n\nThe directory structure has introduces few changes due to the new routing mechanism. Each path in the route has a dedicated directory with a page.tsx file that serves as the content entry point in Next.js 13.\n\nWe can also add <b>layout.tsx</b>, <b>error.tsx</b> and <b>loading.tsx</b> files inside each folder within /app directory.\n\n<img src=\"/images/posts/whatsnewinnextjs/app-directory.png\" alt=\"image-120\"/>\n\nHere, we can create 3 more files (layout.tsx, error.tsx and loading.tsx) parallel to each page.tsx file.\n\n- <b>layout.tsx</b> works as a layout components of that particular route and take all of its child components as props.\n- <b>error.tsx</b> triggers automatically when there is any error in its page.tsx component or any of its child components.\n- <b>loading.tsx</b> it works as a loading screen for the whole layout of this folder.\n\nRead More: [Pages and Layouts in Next.js 13+](https://nextjs.org/docs/app/building-your-application/routing/pages-and-layouts)\n\n<br>\n##### 3. Server Components\nServer components run on the server side for faster delivery, a smaller JavaScript bundle, and less expensive client-side rendering.\n\nBy default, all components created are server components. Use <b>use Client</b> at top of file to make it client component. Combining server and client components allows you to use server components for fast loaded, non-interactive parts of your programme while using client components for interaction, browser APIs, and other features.\n\n    'use client' // Write it at top of file, when you want it to be a client component.\n    export default function Home() {\n    return (\n        <div>\n            <p>\n            Without 'use client' at top, This would be the Server component by default.\n            </p>\n        </div>\n        )\n    }\n\nUsecases of using server components vs client components:\n![Server components in next.js 13+](/images/posts/whatsnewinnextjs/server-components.png#image-70)\n\nRead More: [Server components in Next.js 13+](https://nextjs.org/docs/getting-started/react-essentials)\n\n<br>\n##### 4. Async Components & Data Fetching\nThe Next.js 13+ App Router allows you to fetch data directly in your React components by marking the function as async and using await\n\n    async function fetchData() {\n        const res = await fetch('https://api.website.com/...');\n        return res.json();\n    }\n    export default async function Home() {\n        const data = await fetchData();\n        return <main></main>;\n    }\n\nNext.js 13+ provides a second params to fetch function to decide whether we want to fetch data at build time or at run time from server.\n\n    //Default, Similar to 'getStaticProps' of previous versions.\n    fetch(API_URL, { cache: 'force-cache' })\n\n    // It re-renders already built files after every 10 seconds.\n    fetch(API_URL, { next: { revalidate: 10 } });\n\n    // Similar to 'getServerSideProps' of previous versions.\n    fetch(API_URL, { cache: 'no-store' })\n\nRead More: [Async Components & Data Fetching in Next.js 13+](https://nextjs.org/docs/app/building-your-application/data-fetching/fetching)\n\n<br>\n##### 5. Loading and Streaming\nhe special file <b>loading.tsx</b> helps you create meaningful Loading UI with React Suspense. With this convention, you can show an instant loading state from the server while the content of a route segment loads, the new content is automatically swapped in once rendering is complete.\n\n    export default function Loading() {\n        // You can add any UI inside Loading, including a Skeleton.\n        return <LoadingSkeleton />\n    }\n\n<b>Streaming</b> allows you to break down the page's HTML into smaller chunks and progressively send those chunks from the server to the client.\n\nPreviously, users might have to wait for the complete page to generate. Now the server will transmit the client small pieces of the UI as it is generated.\n\nRead More: [Loading and Streaming in Next.js 13+](https://nextjs.org/docs/app/https://nextjs.org/docs/app/building-your-application/routing/loading-ui-and-streaming)\n\n<br>\n##### 6. Turbopack\nNext.js 13 released a new JavaScript bundler called Turbopack, which is referred to as the “successor to Webpack”.\n\n“Turbopack, which was developed by the Webpack creators and is constructed in Rust, promises to be 700 times faster than the original Webpack”.\n\n    \"dev\": \"next dev --turbo\"\n\nRead More: [Turbopack in Next.js 13+](https://nextjs.org/docs/architecture/turbopack)\n\n<br>\n##### 7. next/image, next/link, next/font\n    // Without <a>, Easier, a time saver, and a clean code.\n    <Link href=\"/about\"> Home </Link>\n\n    // images will load faster, even on slow connections.\n    <Image src=\"/profile.png\" width={500} height={500} alt=\"\" />\n\n    @next/font We don’t need to download the google fonts locally and\n    no need for CDN links.\n    Also it does not send extra external network requests to google fonts\n    and it does not face a layout shift error in next.js which\n    is more important for SEO.\n\nRead More: [next/image, next/link, next/font Next.js 13+](https://nextjs.org/docs/architecture/turbopack)\n\n<br>\n##### 8. MetaData\n\"Next.js has a Metadata API that can used to define your application metadata (e.g. meta and link tags inside your HTML head element) for improved SEO and web shareability\".\n\n    // Add in layout.tsx files. It is Static Metadata\n    import { Metadata } from 'next';\n    export const metadata : Metadata = {\n        title: 'About Page',\n        description: 'About page description',\n    }\n\nYou can also add metadata dynamically with props object above component's function.\n\n    type Props = {\n        params: { id: string }\n        searchParams: { [key: string]: string | string[] | undefined }\n    }\n\nRead More: [next/image, next/link, next/font Next.js 13+](https://nextjs.org/docs/architecture/turbopack)\n"},"__N_SSG":true}